//import{useRouter} from "next/router"
import React, { useState } from "react";
import classes from "../styles/rezka.module.css"
import Router from "next/router";
//import { Product } from "../index.js";
import {Layout} from "/components/Layout/Layout.jsx";
import Image from "next/image";
//import bureniye from "./image/almaz_bureniye.png"



export default function Bureniye() {
  const [details, setDetails] = useState(false);
  const btnClassName = details ? classes.button_b : classes.button;

   return (
   <>
   <Layout title={`Алмазне Буріння`}>
   <div className={classes.wrapper}>
    <div className={classes.container_wrapp}>


     <div className={classes.container_info}>
       <div className={classes.container_image}>
        {/* <img className={classes.image}></img> */}
        <Image
        className={classes.image}
         src="/images/image_slaider/almaz_bureniye.png"
         width={500}
         height={350}
         alt="bureniye"
         priority
         />
      </div>
      <div className={classes.container_text}>
         <h2 className={classes.h2}>Алмазне Буріння</h2>
         <p className={classes.p1}>Алмазне буріння — технологічний підхід для створення точних отворів у різних матеріалах, включаючи бетон та камінь. Цей метод використовується для прокладання комунікацій та виконання робіт з гідроізоляції. Наша команда досвідчених спеціалістів здійснить алмазне буріння з високою точністю та мінімальними пошкодженнями навколишніх структур.
          </p>
      </div>
    </div>

     <div className={classes.container_btn}>
        <div className={classes.button_container}>
             <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
               {details ? "Закрити Опис" : "Детальніший Опис"}
             </button>
        </div>
        <div className={classes.button_container}>
              <button className={classes.button} >Заказати Послугу</button>
        </div>
     </div>


  <div>
     {details &&<div className={classes.container_info_text}>
      <nav className={classes.nav}>
        <p>У сучасній будівельній індустрії точність та ефективність відіграють важливу роль. Діамантове буріння є інноваційним методом, який дозволяє проводити високоточне свердління отворів у різних матеріалах, забезпечуючи мінімальні пошкодження навколишньої конструкції.</p>

         <h4>Застосування діамантового буріння:</h4>
          <li> Діамантове буріння є затребуваним та багатофункціональним методом, який знаходить широке застосування в різних галузях будівництва та ремонту. Його гнучкість та точність роблять його невід’ємним інструментом для створення отворів під проводку, вентиляцію, водопостачання та інші цілі, а також для демонтажу бетонних та залізобетонних конструкцій.</li>
          <li>У сфері інженерних комунікацій, діамантове буріння часто використовується для створення отворів у стінах, підлогах та стелях під проводку електричних кабелів, вентиляційних та водопостачальних труб. Завдяки застосуванню діамантових бурів, можна точно прокладати потрібні шляхи для комунікацій без пошкодження навколишніх конструкцій.</li>
          <li>У сфері демонтажу та реконструкції, діамантове буріння також відіграє важливу роль. Завдяки високій точності та контролю над процесом, цей метод дозволяє проводити демонтаж бетонних та залізобетонних конструкцій без створення зайвих пошкоджень. Це особливо важливо при роботі в обмежених або чутливих умовах.</li>
          <li>Застосування діамантового буріння також знаходить своє місце в будівництві та ремонті інфраструктури, такої як дороги, мости та тунелі. Воно дозволяє точно виконувати отвори для кріпильних елементів, дренажних систем та інших інженерних потреб.</li>
          <li>В цілому, діамантове буріння представляє собою ефективний та прецизійний метод, здатний задовольнити різноманітні потреби в галузі будівництва та ремонту. Його застосування сприяє точному втіленню проектів, мінімізації пошкоджень та забезпеченню високої якості робіт.</li>

          <h4>Процес діамантового буріння:</h4>

           <li>Процес діамантового буріння є технологічним методом, який дозволяє створювати точні та чисті отвори в різних матеріалах. Цей процес використовує спеціалізовані бурові інструменти, такі як бурові коронки з діамантовими кристалами, для подолання навіть найтвердіших і різноманітних матеріалів.</li>

           <h4>Вибір відповідного інструменту:</h4>
               <li>Залежно від типу матеріалу, його товщини та вимог до діаметру отвору, вибирається відповідна бурова коронка з діамантовими кристалами. Різні типи коронок можуть використовуватися для буріння бетону, каменю, цегли, металу та інших матеріалів.</li>
           <h4>Підготовка поверхні:</h4>
                <li>Поверхня, на яку планується виконати буріння, повинна бути чистою та, якщо можливо, рівною. Підготовка поверхні забезпечує більш точне та безпечне виконання процесу.</li>
           <h4>Фіксація бурової коронки:</h4>
               <li>Бурова коронка з діамантовими кристалами встановлюється на буровий станок або інше спеціалізоване обладнання. Вона фіксується та розташовується в місці, де потрібно виконати отвір.</li>
           <h4>Процес буріння:</h4>
             <li>За допомогою бурового станка або ручного інструменту починається процес буріння. Діамантові кристали на коронці обертаються та постійно впливають на поверхню, подолаючи матеріал і створюючи отвір. Процес контролюється, щоб забезпечити рівномірне та точне буріння.</li>
           <h4>Охолодження та видалення матеріалу:</h4>
             <li>Під час буріння важливо забезпечити охолодження бурової коронки, щоб уникнути перегріву. Утворюючіся стружки та пил також видаляються, щоб забезпечити чистоту та ефективність процесу.</li>
           <h4>Завершення та обробка отвору:</h4>
              <li>Після завершення буріння отвір може вимагати обробки для видалення залишкової стружки та забезпечення гладкої поверхні.</li>
            <li>Діамантове буріння відрізняється високою точністю, міцністю та здатністю подолати найрізноманітніші матеріали. Цей метод знаходить застосування в будівництві, ремонті, монтажі та інших областях, де потрібне точне та якісне створення отворів.</li>

          <h4>Використовувані матеріали та технології:</h4>

            <li>Для діамантового буріння застосовується спеціалізоване обладнання та технології, які дозволяють ефективно подолати різноманітні матеріали.</li>
           <h4>Ось деякі з них:</h4>

           <h4>Діамантові бурові станки:</h4>
               <li>Ці станки спеціально розроблені для роботи з діамантовими коронками. Вони забезпечують стабільне та точне свердління під різними кутами та глибинами.</li>
          <h4>Діамантові коронки:</h4>
           <li>Діамантові коронки представляють собою металеві коронки, внутрішня поверхня яких покрита діамантовими кристалами. Ці кристали забезпечують високий ступінь зносостійкості та здатність подолати тверді матеріали.</li>
         <h4>Сегментовані коронки:</h4>
           <li>Коронки можуть мати різні види сегментів, залежно від типу матеріалу, який потрібно просвердлити. Сегментовані коронки дозволяють ефективніше управляти процесом буріння.</li>
         <h4>Водяне охолодження:</h4>
           <li>Для запобігання перегріву діамантових коронок та збільшення їх терміну служби застосовується водяне охолодження. Вода охолоджує коронку та змиває стружку, що покращує ефективність буріння.</li>

         <h4>Регульована швидкість та потужність:</h4>
              <li>Сучасні діамантові бурові станки зазвичай мають регульовану швидкість обертання та потужність, що дозволяє адаптувати процес буріння до різних матеріалів та умов.</li>

           <h4>Технології обробки діамантів:</h4>
               <li>Розвиток технологій з обробки діамантів дозволяє створювати кристали з різними характеристиками, адаптованими під конкретні умови буріння.</li>
           <h4>Інновації в конструкції коронок:</h4>
                <li>Конструкція коронок постійно вдосконалюється для збільшення їх продуктивності та довговічності. Це включає розробку нових форм сегментів, матеріалів та способів їх закріплення.</li>
           <h4>Точне позиціонування:</h4>
                 <li>Деякі діамантові бурові станки оснащені системами точного позиціонування, які дозволяють створювати точні та симетричні отвори.</li>
            <li>Використання спеціалізованого обладнання та постійне вдосконалення технологій діамантового буріння дозволяють ефективно виконувати завдання зі створення отворів в різних матеріалах, включаючи бетон, камінь, метал та інші тверді поверхні.</li>

          <h4>Переваги та обмеження:</h4>

           <h4>Переваги діамантового буріння:</h4>

           <h4>Висока точність:</h4>
             <li>Діамантове буріння дозволяє досягати високої точності при створенні отворів, що особливо важливо для завдань, які вимагають точних розмірів та позицій отворів.</li>
           <h4>Мінімальні вібрації:</h4>
             <li>Порівняно з традиційними методами буріння, діамантове буріння створює менше вібрацій, що знижує ризик пошкодження оточуючої конструкції та мінімізує дискомфорт.</li>
           <h4>Низька ймовірність пошкодження:</h4>
             <li>Використання діамантових буров дозволяє більш точно контролювати процес буріння, що зменшує ймовірність пошкодження сусідніх елементів конструкції.</li>
           <h4>Робота з різноманітними матеріалами:</h4>
             <li>Діамантове буріння може застосовуватися для широкого спектру матеріалів, включаючи бетон, залізобетон, камінь, цеглу та інші тверді та щільні матеріали.</li>
           <h4>Обмеження діамантового буріння:</h4>

           <h4>Обмеження за матеріалами:</h4>
             <li>У деяких випадках, особливо при роботі з дуже твердими матеріалами, діамантове буріння може бути повільнішим та вимогливим до інструментів.</li>
            <h4>Складнощі при роботі з м’якими матеріалами:</h4>
              <li>Для м’яких і менш щільних матеріалів діамантове буріння може бути незрозумілим та неефективним методом.</li>
            <h4>Потребує спеціалізованого обладнання:</h4>
              <li>Діамантове буріння потребує спеціалізованого обладнання та інструментів, що може вплинути на доступність та вартість робіт.</li>
            <h4>Складнощі при бурінні великих отворів:</h4>
               <li>Буріння дуже великих діаметрів отворів може потребувати потужніше обладнання та додаткові заходи попередження.</li>
            <h4>Вплив на навколишнє середовище:</h4>
               <li>Під час процесу діамантового буріння можуть утворюватися пил та виділення, які можуть потребувати додаткових заходів для захисту навколишнього середовища та здоров’я працівників.</li>
            <li>Діамантове буріння є ефективним методом для створення точних та якісних отворів, але під час його вибору потрібно враховувати характеристики матеріалу та особливості проекту.</li>

          <h4>Порівняння з іншими методами:</h4>

            <li>Діамантове буріння вирізняється своєю точністю, чистотою та ефективністю, що робить його переважаючим методом у випадках, коли потрібна висока точність і мінімальні пошкодження навколишньої структури. Проте вибір методу залежить від характеру робіт, доступності обладнання та обмежень бюджету.</li>

          <h4>Приклади успішних застосувань:</h4>

            <li>Діамантове буріння успішно використовується для створення відкриттів для вікон та дверей у бетонних стінах, а також для проведення комунікацій у житлових та комерційних будівлях.</li>

          <h4>Поради щодо вибору та застосування:</h4>

            <li>При виборі діамантового буріння важливо визначити матеріал, який потрібно пробурити, та вибрати відповідну коронку. Рекомендується звернутися до досвідчених фахівців для досягнення найкращих результатів.</li>

          <h4>Висновок:</h4>

            <li>Діамантове буріння є передовим методом у будівельній галузі, який забезпечує високоточне та швидке створення отворів у різних матеріалах. Цей метод не тільки підвищує точність та ефективність робіт, але також зменшує часові та фінансові витрати, що робить його невід’ємною частиною сучасних будівельних технологій.</li>

            <li>Переваги діамантового буріння включають високу точність, мінімальні вібрації, а також здатність впоратися з різноманітними матеріалами. Однак важливо пам’ятати про необхідність вибору відповідного обладнання та інструментів, а також про дотримання технічних стандартів та правил для безпечної та ефективної роботи. Діамантове буріння продовжує відігравати значущу роль у будівельній галузі, сприяючи оптимізації процесів та досягненню високих результатів.</li>

      </nav>




    <div className={classes.container_btn}>
       <div className={classes.button_container}>
           <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
           Закрити Опис
           </button>
       </div>
       <div className={classes.button_container}>
           <button className={classes.button} >Заказати Послугу</button>
       </div>
    </div>




    </div>}

  </div>
     <div className={classes.button_top}>
      <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
    </div>

    {/* <button className={classes.button_wrapp} onClick={() => Router.push(`/`)}>Вернутись назад</button> */}
    </div>

   </div>


   </Layout>
   </>
   )
}