import React, { useState } from "react";
import classes from "../styles/rezka.module.css"
import Router from "next/router";
import {Layout} from "/components/Layout/Layout.jsx"
import Image from "next/image";

export default function Torkret() {
  const [details, setDetails] = useState(false);
  const btnClassName = details ? classes.button_b : classes.button;
   return (
   <>
   <Layout title={`Торкретування`}>
   <div className={classes.wrapper}>
    <div className={classes.container_wrapp}>


     <div className={classes.container_info}>
       <div className={classes.container_image}>
        <Image
        className={classes.image}
         src="/images/image_slaider/torkret.png"
         width={500}
         height={350}
         alt="torkret"
         priority
         />
      </div>
      <div className={classes.container_text}>
         <h2 className={classes.h2}>Торкретування</h2>
         <p className={classes.p1}>Торкретування — сучасний метод нанесення бетонних сумішей з високою щільністю на поверхні. Він застосовується для гідроізоляції басейнів, стін та інших об'єктів. Торкретування забезпечує герметичність і міцність, захищаючи вашу конструкцію від проникнення вологи.
         </p>
      </div>
    </div>

    <div className={classes.container_btn}>
        <div className={classes.button_container}>
             <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
               {details ? "Закрити Опис" : "Детальніший Опис"}
             </button>
        </div>
        <div className={classes.button_container}>
              <button className={classes.button} >Заказати Послугу</button>
        </div>
     </div>


    <div>
     {details &&<div className={classes.container_info_text}>
      <nav className={classes.nav}>
        <p>У сучасному будівництві методи ремонту та зміцнення конструкцій відіграють важливу роль у забезпеченні їх тривалості та безпеки. Торкретування, також відоме як “суха будівельна суміш”, представляє передовий підхід до ремонту, захисту та підсилення будівельних елементів.
        </p>
        <h4>Застосування торкретування:</h4>

            <li>Торкретування – це потужний та багатоцільовий метод, який широко використовується в галузі ремонту, зміцнення та підсилення різноманітних конструкцій. Його сфера застосування охоплює стіни, стелі, колони, мости і навіть тунелі. Цей метод дозволяє не лише відновлювати пошкоджені поверхні, але й створювати захисні шари для протистояння агресивним факторам, а також підсилювати конструкції для підвищення їх навантажувальної здатності.</li>

            <li>У галузі ремонту торкретування знаходить широке застосування для відновлення поверхонь, що піддалися зносу, корозії чи іншим механічним пошкодженням. Метод дозволяє точно наносити ремонтний матеріал на поверхню, забезпечуючи хорошу адгезію та мінімізуючи можливість утворення повітряних порожнин. Це допомагає відновити цілісність конструкції та подовжити її термін служби.</li>

            <li>Захисні шари, створені за допомогою торкретування, здатні ефективно справлятися з агресивними факторами, такими як хімічні речовини, волога та абразивні частки. Це особливо актуально при ремонті споруд в індустріальних умовах або в районах з невигідною екологією.</li>

            <li>Важливою сферою застосування торкретування є підсилення конструкцій. Метод дозволяє наносити високоміцні матеріали на поверхні, збільшуючи їх навантажувальну здатність та стійкість до динамічних навантажень. Це може бути особливо важливим при реконструкції мостів, тунелів та інших інфраструктурних об’єктів.</li>

            <li>Отже, торкретування є багатоцільовим методом, який сприяє ремонту, зміцненню та підсиленню різноманітних конструкцій. Його гнучкість та ефективність роблять його незамінним інструментом у галузі будівництва та ремонту, дозволяючи підтримувати інфраструктуру у надійному та функціональному стані.</li>

<h4>Процес торкретування:</h4>

            <li>Процес торкретування – це технологічний метод, який має широке застосування в ремонті, зміцненні та відновленні різноманітних конструкцій. Цей процес включає кілька ключових етапів, які забезпечують точне та рівномірне нанесення спеціальної суміші, відомої як торкрет.</li>

<h4>Підготовка суміші:</h4>
             <li>Спочатку готується спеціальна суміш торкрету. Вона складається з цементу, піску, води та добавок. Добавки можуть варіювати в залежності від потрібних властивостей торкрету, таких як міцність, адгезія, водонепроникність та інші характеристики.</li>
<h4>Підготовка поверхні:</h4>
              <li>Поверхню, на яку буде нанесено торкрет, слід очистити від бруду, пилу та інших забруднень. Також може знадобитися попереднє зміцнення або обробка поверхні для забезпечення хорошої адгезії торкрету.</li>
<h4>Нанесення суміші:</h4>
              <li>Суміш торкрету подається на поверхню за допомогою стиснутого повітря. Цей процес може здійснюватися за допомогою спеціалізованого обладнання для торкретування, яке забезпечує рівномірне та контрольоване нанесення суміші.</li>
<h4>Ущільнення та консолідація:</h4>
               <li>Суміш торкрету наноситься на поверхню до потрібної товщини. На цьому етапі може застосовуватися додаткове ущільнення за допомогою інструментів, щоб забезпечити хорошу адгезію та ущільнення між торкретом та поверхнею.</li>
<h4>Висихання та вицвітання:</h4>
              <li>Після нанесення суміші торкрету вона вимагає часу для висихання та вицвітання. Протягом цього періоду торкрет набуває своїх кінцевих характеристик, таких як міцність та навантажувальна здатність.</li>
             <li>Процес торкретування ефективно дозволяє відновлювати поверхні, створювати захисні шари від агресивних факторів, а також зміцнювати конструкції для підвищення їх навантажувальної здатності. Цей метод відрізняється високою міцністю, тривалістю та точністю, що робить його важливим інструментом в галузі будівництва та ремонту.</li>

<h4>Використовувані матеріали та технології:</h4>

            <li>Для процесу торкретування використовують спеціальні суміші та технології, які забезпечують ефективне нанесення матеріалу на поверхні.</li>
<h4>Ось деякі з них:</h4>

<h4>Суміші для торкрету:</h4>
            <li>Суміші для торкрету складаються з цементу, піску, води та добавок, які надають матеріалу необхідні властивості, такі як міцність, пластичність та адгезія. Ці добавки можуть включати пластифікатори, прискорювачі або волокна для поліпшення характеристик суміші.</li>
<h4>Адаптивні суміші для торкрету:</h4>
            <li>Нові технології дозволяють розробляти адаптивні суміші для торкрету, які можуть змінювати свої характеристики залежно від умов. Наприклад, нанесення торкрету на вертикальну поверхню може вимагати щільнішої суміші, ніж на горизонтальну.</li>
<h4>Технології подачі торкрету:</h4>
            <li>Для нанесення торкрету використовують різні методи, включаючи пневматичний (сухий або мокрий) та механічний способи. Пневматичний спосіб передбачає подачу суміші за допомогою стиснутого повітря, а механічний – за допомогою спеціалізованого обладнання з гвинтовим механізмом.</li>
<h4>Торкретові насадки:</h4>
            <li>Для досягнення рівномірного розподілу торкрету використовують спеціальні насадки на пневматичних або механічних пристроях. Ці насадки забезпечують точне та рівномірне нанесення суміші на поверхню.</li>
<h4>Механізоване обладнання:</h4>
            <li>Процес торкретування може бути механізований за допомогою спеціалізованого обладнання, такого як торкретові машини. Ці машини дозволяють контролювати подачу суміші та забезпечують більш рівномірне покриття.</li>
<h4>Процес нанесення:</h4>
           <li>Торкрет наноситься на підготовлену поверхню з певної відстані. При цьому важливо забезпечити рівномірне покриття та уникнути утворення порожнин.</li>

<h4>Компактність та затвердіння:</h4>
             <li>Після нанесення торкрету він може піддаватися вібрації або ручному ущільненню для забезпечення компактності та видалення повітряних пузирів. Потім торкрет залишається на деякий час для затвердіння та отримання міцності.</li>

            <li>Використання спеціальних сумішей для торкрету та сучасних технологій нанесення дозволяє створювати міцні та довговічні захисні шари на різних поверхнях, таких як стіни, стеле, колони та інші конструкції.</li>

<h4>Переваги та обмеження:</h4>

<h4>Переваги торкретування:</h4>

<h4>Швидкість виконання:</h4>
            <li>Торкретування дозволяє швидко нанести шар матеріалу на поверхню, що може бути особливо корисним при ремонтних або реконструкційних роботах.</li>
<h4>Універсальність застосування:</h4>
            <li>Торкретування можна використовувати як на вертикальних, так і на горизонтальних поверхнях, що робить його зручним для різноманітних конструкцій.</li>
<h4>Чудове зчеплення:</h4>
            <li>Торкрет створює хороше зчеплення з базовою поверхнею, забезпечуючи міцне зчеплення та надійну адгезію.</li>
<h4>Мінімальні відходи:</h4>
             <li>Торкрет наноситься безпосередньо на поверхню, що зменшує утворення відходів, пов’язаних з обрізанням матеріалу.</li>
<h4>Обмеження торкретування:</h4>

<h4>Технологічні нюанси:</h4>
             <li>Торкретування вимагає певних навичок і знань, щоб правильно регулювати параметри подачі матеріалу та тиску повітря.</li>
<h4>Вибір складу торкрету:</h4>
             <li>Для кожної конкретної задачі необхідно правильно підібрати склад торкрету з урахуванням характеристик поверхні, умов експлуатації та вимог до міцності.</li>
<h4>Рівномірне нанесення:</h4>
             <li>Рівномірне нанесення торкрету може бути складним на нерівних поверхнях або в важкодоступних місцях.</li>
<h4>Вплив на навколишнє середовище:</h4>
             <li>Торкретування може викликати пил та викиди матеріалу у повітря, що може потребувати додаткових заходів забезпечення безпеки та захисту навколишнього середовища.</li>
<h4>Не завжди підходить для тонких шарів:</h4>
             <li>Для створення дуже тонких шарів торкрету можуть знадобитися спеціальні технології та обладнання.</li>
<h4>Вплив на поверхню:</h4>
            <li>Використання торкрету може залишити видимі сліди на поверхні, які можуть потребувати додаткових оздоблювальних робіт.</li>
            <li>Важливо ретельно оцінити переваги та обмеження торкретування в контексті конкретного проекту і належним чином підготуватися до його виконання з урахуванням технологічних особливостей.</li>

<h4>Порівняння з іншими методами:</h4>

            <li>Торкретування вирізняється своєю швидкістю нанесення та рівномірністю, що сприяє підвищеній адгезії та міцності. Однак перед вибором методу ремонту та підсилення необхідно враховувати вимоги проекту, характер пошкоджень, доступність обладнання та навички.</li>

<h4>Приклади успішних застосувань:</h4>

            <li>Торкретування успішно використовується при відновленні бетонних поверхонь мостів, підсиленні стін підземних споруд, а також в реставрації та ремонті старих будівель.</li>

<h4>Поради щодо вибору та застосування:</h4>

            <li>Для успішного торкретування рекомендується звернутися до досвідчених фахівців, які допоможуть вибрати підходящий склад та обладнання, а також провести роботи згідно з технологічними вимогами.</li>

<h4>Висновок:</h4>

            <li>Торкретування – це метод ремонту, підсилення та захисту будівельних конструкцій, який демонструє ефективність та інноваційний підхід. За допомогою цього методу можна забезпечувати надійність та тривалість споруд, зберігаючи їх функціональність на протязі багатьох років.</li>

            <li>Технологічні досягнення в галузі торкретування дозволяють досягати високої адгезії до поверхонь, забезпечувати рівномірне та щільне нанесення матеріалу, а також підсилювати конструкції для підвищення їх навантажувальної здатності. Однак для успішного торкретування необхідно враховувати особливості кожного проекту, правильно підібрати склад торкрету та забезпечити його якісне нанесення.</li>

            <li>Торкретування залишається важливим інструментом у сучасному будівництві та ремонті, сприяючи збереженню та міцності будівельних об’єктів на тривалий час.</li>






      </nav>

      <div className={classes.container_btn}>
       <div className={classes.button_container}>
           <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
           Закрити Опис
           </button>
       </div>
       <div className={classes.button_container}>
           <button className={classes.button} >Заказати Послугу</button>
       </div>
      </div>


    </div>}


  </div>
  <div className={classes.button_top}>
  <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
  </div>

    </div>

   </div>



   </Layout>
   </>
   )
}