//import{useRouter} from "next/router"
import React from "react";
import classes from "../styles/compani.module.css"
import Router from "next/router";
//import { Product } from "../index.js";
import {Layout} from "/components/Layout/Layout.jsx"
//import {products} from "../data/products.ts"

export default function Compani() {
   return (
   <>
   <Layout title={`Про Компанію`}>
   <div className={classes.wrapper}>
               <div className={classes.container_info}>
                     <h1 className={classes.h1}>ПРО КОМПАНІЮ «БНМ-БУД-55»</h1>
                                  <p className={classes.p}>ТОВ «БНМ-БУД-55» з впевненістю може
                                    заявити про себе високою якістю та  надійністю. Довговічність і
                                    тривалий термін гарантії є неодмінною у виконанні робіт будь-якого
                                    рівня складності на об’єктах різного призначення.
                                  </p>
                                  <p className={classes.p}>ТОВ«БНМ-БУД-55» — компанія на ринку, яка у роботі
                                    враховує специфіку навколишнього середовища. Надає гарантії на виконані
                                    нами роботи строком від 5 років! Ми використовуємо в роботі над об’єктом
                                     власну технічну базу та спеціалістів високого рівня підготовки. З
                                    моменту вашої заявки наші спеціалісти виїжджають на об’єкт для
                                    детального вивчення його специфіки, оскільки тільки так можна оцінити
                                    всю складність, не обмежуючись почутим. Ви отримуєте наше комерційне
                                    пропозицію з описом всього спектра необхідних матеріалів та робіт. Маєте
                                     можливість легко спостерігати за проведенням робіт на кожному з їх
                                    етапів до моменту здачі об’єкта. Ми несемо відповідальність за терміни
                                    та якість, надаючи гарантії на об’єкти різного рівня складності,
                                    володіємо досвідом та технічною базою — це те, що вигідно нас відрізняє
                                    на ринку.
                                   </p>
                 </div>
                 <div className={classes.button_top}>
                 <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
                 </div>

   </div>







   </Layout>
   </>
   )
}