import React, { useState } from "react";
import classes from "../styles/rezka.module.css"
import Router from "next/router";
import {Layout} from "/components/Layout/Layout.jsx"
import Image from "next/image";
//import inject from "./image/inject_gidro.png"

export default function Inject() {
  const [details, setDetails] = useState(false);
  const btnClassName = details ? classes.button_b : classes.button;
   return (
   <>
   <Layout title={`Ін'єкційна Гідроізоляція`}>
   <div className={classes.wrapper}>
    <div className={classes.container_wrapp}>


     <div className={classes.container_info}>
       <div className={classes.container_image}>
        {/* <img className={classes.image}></img> */}
        <Image
        className={classes.image}
         src="/images/image_slaider/inject_gidro.png"
         width={500}
         height={350}
         alt="inject"
         priority
         />
      </div>
      <div className={classes.container_text}>
         <h2 className={classes.h2}>Ін'єкційна Гідроізоляція</h2>
         <p className={classes.p1}>Ін'єкційна гідроізоляція — передовий метод захисту будівель від вологи. За допомогою спеціальних композицій вони вприскуються в структуру матеріалу, створюючи непроникний бар'єр. Цей метод ефективний для фундаментів, стін та підвалів. Наша команда професіоналів виконає ін'єкційну гідроізоляцію з високою точністю та надійністю, забезпечуючи довговічність вашої будівлі.
         </p>
      </div>
    </div>

    <div className={classes.container_btn}>
        <div className={classes.button_container}>
             <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
               {details ? "Закрити Опис" : "Детальніший Опис"}
             </button>
        </div>
        <div className={classes.button_container}>
              <button className={classes.button} >Заказати Послугу</button>
        </div>
     </div>


    <div>
     {details &&<div className={classes.container_info_text}>
      <nav className={classes.nav}>
        <p>Гідроізоляція – це невід’ємний етап в будівництві, спрямований на захист споруд від впливу вологи та води. Серед різних методів гідроізоляції виділяється ін’єкційна гідроізоляція – ефективний спосіб запобігти шкідливому впливу вологи на будівлі та споруди. Вона базується на використанні спеціальних матеріалів, внедрюваних у матеріали будівельних конструкцій для створення бар’єру вологостійкості.</p>

<h4>Застосування ін’єкційної гідроізоляції:</h4>

<li>Ін’єкційна гідроізоляція є важливим інструментом для забезпечення захисту різних типів споруд від вологи та вмісту вологи. Її застосування охоплює широкий спектр об’єктів, починаючи від підземних паркінгів і закінчуючи підвалами житлових будинків. Однією з ключових переваг цього методу є його ефективність у вирішенні різноманітних проблем, пов’язаних з витоками, підвищеною вологістю та ґрунтовою водою.</li>

<li>У підземних структурах, таких як підземні паркінги, ін’єкційна гідроізоляція відіграє важливу роль у створенні надійного бар’єрного захисту від вологи та підтоку води. Вона дозволяє запобігти проникненню води через пори та тріщини в будівельних матеріалах, таким чином, збільшуючи термін служби споруди та мінімізуючи ризик пошкоджень.</li>

<li>Крім того, ін’єкційна гідроізоляція також знаходить застосування при вирішенні проблем вологості в підвалах житлових будинків. Висока вологість може викликати появу плісняви, корозію металевих елементів та руйнування будівельних матеріалів. Процес ін’єкційної гідроізоляції дозволяє ефективно усунути джерело вологості, створюючи бар’єр між ґрунтовою водою та внутрішньою обстановкою приміщення.</li>

<li>Отже, ін’єкційна гідроізоляція є надійним методом для боротьби з вологою та вмістом вологи в різних типах споруд. Її успішне застосування сприяє збереженню структурної цілісності будівель і споруд, підвищуючи їх тривалість та функціональність.</li>

<h4>Процес ін’єкційної гідроізоляції:</h4>

<li>Процес ін’єкційної гідроізоляції є важливим методом забезпечення захисту будівельних поверхонь від вологи. Цей процес складається з кількох ключових етапів, кожний з яких відіграє важливу роль у створенні надійного водонепроникного бар’єру.</li>

<h4>Підготовка поверхні:</h4>
<li>На початку процесу проводиться ретельна підготовка поверхні, яка буде оброблятися. Це включає в себе очищення від бруду, пилу, масел, старих покриттів та інших забруднень. Чиста поверхня дозволяє забезпечити кращу адгезію ін’єкційних матеріалів до поверхні.</li>
<h4>Виявлення дефектів:</h4>
 <li>На цьому етапі виявляються можливі дефекти, такі як тріщини, пори, шви та інші місця, через які може проникати вода. Це дозволяє визначити місця, які потребують ін’єкцій, та усунути потенційні джерела вологості.</li>
<h4>Вибір ін’єкційних матеріалів:</h4>
 <li>Залежно від характеристик поверхні, виду дефектів та умов експлуатації, вибираються відповідні ін’єкційні матеріали. Це можуть бути полімери, цементні сполуки, акрилові реактиви та інші спеціалізовані з’єднання.</li>
<h4>Проведення ін’єкцій:</h4>
 <li>На цьому етапі відбувається внесення вибраних ін’єкційних матеріалів у поверхню. Зазвичай це робиться за допомогою спеціальних ін’єкційних насосів або апаратів. Матеріали вприскуються під тиском в тріщини, пори та інші дефекти матеріалу.</li>
Формування водонепроникного бар’єру:
  <li>В результаті ін’єкцій ін’єкційні матеріали заповнюють дефекти та створюють непроникний бар’єр для вологи. Вони заслонюють пори і тріщини, запобігаючи проникненню води та вологості.</li>
<h4>Час висихання та зміцнення:</h4>
  <li>Після проведення ін’єкцій потрібний час для висихання та зміцнення ін’єкційних матеріалів. Це може зайняти різний час в залежності від типу матеріалу та умов навколишнього середовища.</li>
 <li>В результаті процесу ін’єкційної гідроізоляції досягається ефективний захист поверхні від вологи та вмісту вологи. Цей метод забезпечує довгострокову надійність споруд і запобігає негативним наслідкам, пов’язаним з проникненням води.</li>

<h4>Використовувані матеріали та технології:</h4>

<li>Використання відповідних матеріалів та технологій у процесі ін’єкційної гідроізоляції відіграє ключову роль у забезпеченні ефективного захисту від вологості та вологості. Залежно від конкретних умов, типу поверхні та необхідних характеристик гідроізоляції, вибираються підходящі ін’єкційні матеріали.</li>

<h4>Полімерні сполуки:</h4>
<li>Полімерні ін’єкційні сполуки мають гнучкість, адгезію та здатність проникати навіть у найдрібніші тріщини та пори матеріалів. Це робить їх ідеальними для ущільнення та заповнення дефектів, які можуть бути недоступні для більш рідких сполук. Полімери також володіють хімічною стійкістю, що дозволяє їм ефективно впоратися з агресивними середовищами.</li>
<h4>Цементні сполуки:</h4>
<li>Цементні ін’єкційні сполуки надають високу міцність та довговічність. Вони особливо корисні у зонах з великими навантаженнями, таких як фундаменти та структури з великою вагою. Цементні сполуки можуть створювати стійкий до води та хімічних впливів бар’єр.</li>
<h4>Гідроактивні гелі:</h4>
<li>Ці гелі є відносно новим розвитком у галузі ін’єкційної гідроізоляції. Вони реагують з вологою, утворюючи гелеподібну масу, яка заповнює тріщини та пори. Гідроактивні гелі мають здатність розподілятися по поверхні та досягати однорідної щільності, що робить їх ефективними для різних сценаріїв.</li>
<h4>Акрилові смоли:</h4>
<li>Акрилові смоли використовуються для створення гнучкого та водонепроникного бар’єру. Вони добре зчеплюються з різноманітними поверхнями, такими як бетон, цегла та дерево. Ці смоли також володіють високою стійкістю до ультрафіолетового випромінювання та хімічних впливів.</li>
<h4>Поліуретанові сполуки:</h4>
<li>Поліуретани мають відмінну адгезію та структурну міцність. Вони можуть використовуватися для ущільнення та заповнення тріщин, а також для створення водонепроникного бар’єру на поверхні. Поліуретани також можуть вирішувати активні витоки води.</li>
<h4>Реактивні смоли:</h4>
<li>Ці смоли реагують з водою, утворюючи герметичний бар’єр. Вони можуть використовуватися для заповнення тріщин і порожнеч, а також для зміцнення поверхні.</li>
<h4>Мікроцементні сполуки:</h4>
<li>Мікроцементи надають тонкий, але міцний шар гідроізоляції. Їх часто використовують для декоративної обробки та захисту поверхонь у вологих умовах.</li>
<li>Технології та матеріали для ін’єкційної гідроізоляції постійно розвиваються, надаючи більш ефективні рішення, пристосовані до різних сценаріїв. Важливо обирати відповідні матеріали залежно від характеристик поверхні та умов експлуатації, щоб забезпечити надійний захист від вологості та збільшити довговічність споруд.</li>

<h4>Переваги та обмеження:</h4>

<h4>Переваги ін’єкційної гідроізоляції:</h4>

<h4>Збільшена міцність:</h4>
<li>Ін’єкційні матеріали, проникаючи в пори та тріщини матеріалу, створюють додатковий бар’єр, що підвищує міцність та стійкість конструкції до впливу води.</li>
<h4>Довговічність:</h4>
<li>Правильно виконана ін’єкційна гідроізоляція може забезпечити довготривалий захист від вологості, що збільшує термін служби споруди.</li>
<h4>Мінімальне втручання:</h4>
<li>Процес ін’єкційної гідроізоляції зазвичай не потребує руйнівних робіт, таких як демонтаж чи розбірка конструкції. Це зменшує вплив на навколишнє середовище та економить час.</li>
<h4>Універсальність застосування:</h4>
<li>Ін’єкційна гідроізоляція може застосовуватися на різних типах поверхонь та в різноманітних конструкціях, включаючи підземні споруди, фундаменти, стіни тощо.</li>
<h4>Обмеження ін’єкційної гідроізоляції:</h4>

<h4>Стан поверхні:</h4>
<li>Ін’єкційна гідроізоляція може бути менш ефективною в разі сильно пошкоджених або руйнівних поверхонь, оскільки матеріали можуть не забезпечити надійне ущільнення.</li>
<h4>Особливості конструкції:</h4>
<li>Деякі структури мають особливості, такі як складні геометричні форми або неоднорідні матеріали, що може ускладнити рівномірне розподілення ін’єкційних матеріалів.</li>
<h4>Не завжди усуває корінну причину:</h4>
<li>Ін’єкційна гідроізоляція може запобігати проникненню вологості, але вона не завжди усуває корінну причину виникнення проблеми, такої як недоліки дренажної системи або гідростатичний тиск.</li>
<h4>Обмежене застосування всередині приміщень:</h4>
<li>Всередині приміщень ін’єкційна гідроізоляція може ускладнюватися наявністю обладнання, меблів та оздоблювальних матеріалів.</li>
<h4>Залежність від вибору матеріалів:</h4>
<li>Ефективність ін’єкційної гідроізоляції може залежати від правильного вибору ін’єкційних матеріалів згідно з типом поверхні та умовами.</li>
<li>Важливо підходити до застосування ін’єкційної гідроізоляції з урахуванням конкретних умов і потреб конкретного проекту, щоб максимально використовувати її переваги та врахувати можливі обмеження.</li>

<h4>Порівняння з іншими методами:</h4>

<li>Ін’єкційна гідроізоляція, яка створює неперервний бар’єр всередині матеріалів, може бути перевагою у випадках, коли потрібний максимально надійний захист від вологості та протікань. Мембранні та рулонні методи можуть бути зручнішими для поверхонь, де нанесення ін’єкційних матеріалів ускладнене або неможливе. Вибір методу гідроізоляції повинен враховувати особливості конкретного проекту, стан поверхні та вимоги до надійності захисту.</li>

<h4>Приклади успішних застосувань:</h4>

<li>Існує безліч успішних прикладів застосування ін’єкційної гідроізоляції. Наприклад, в разі старих будівель з тріщинами у фундаменті цей метод може успішно запобігти протіканням та посилити конструкцію.</li>

<h4>Поради щодо вибору та виконання:</h4>

<li>Вибір та виконання ін’єкційної гідроізоляції потребує уважного та професійного підходу. Співпраця з кваліфікованими експертами та дотримання рекомендацій допоможуть досягти ефективного захисту поверхонь від вологості.</li>

<h4>Висновок:</h4>

<li>Ін’єкційна гідроізоляція відіграє ключову роль у забезпеченні довговічності та надійності будівельних об’єктів. За допомогою цього методу вдається ефективно боротися з проблемами вологості, забезпечуючи збереження конструкцій протягом тривалого часу. Різноманітність ін’єкційних матеріалів та технологій дозволяє застосовувати цей метод на різних типах поверхонь та в різноманітних умовах.</li>

<li>Ін’єкційна гідроізоляція демонструє свою ефективність у створенні надійних бар’єрів від води та вологості, що в свою чергу сприяє збільшенню терміну служби споруд та зниженню витрат на їх ремонт та обслуговування. Проте при виборі та виконанні даного методу необхідно враховувати особливості конкретного проекту, тип поверхні та умови експлуатації. Отже, ін’єкційна гідроізоляція стає невід’ємним інструментом у сучасному будівництві, забезпечуючи стійкість та надійність будівельних об’єктів перед впливом води та вологості.</li>



      </nav>

      <div className={classes.container_btn}>
       <div className={classes.button_container}>
           <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
           Закрити Опис
           </button>
       </div>
       <div className={classes.button_container}>
           <button className={classes.button} >Заказати Послугу</button>
       </div>
      </div>



    </div>}


  </div>
  <div className={classes.button_top}>
  <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
  </div>

    {/* <button className={classes.button_wrapp} onClick={() => Router.push(`/`)}>Вернутись назад</button> */}
    </div>

   </div>




   </Layout>
   </>
   )
}