import React, { useState } from "react";
import classes from "../styles/rezka.module.css"
import Router from "next/router";
import {Layout} from "/components/Layout/Layout.jsx"
import Image from "next/image";
//import obmaz from "./image/obmaz_gidro.png"

export default function Obmaz() {
  const [details, setDetails] = useState(false);
  const btnClassName = details ? classes.button_b : classes.button;
   return (
   <>
   <Layout title={`Обмазувальна Гідроізоляція`}>
   <div className={classes.wrapper}>
    <div className={classes.container_wrapp}>


     <div className={classes.container_info}>
       <div className={classes.container_image}>
        {/* <img className={classes.image}></img> */}
        <Image
        className={classes.image}
         src="/images/image_slaider/obmaz_gidro.png"
         width={500}
         height={350}
         alt="obmazobmaz"
         priority
         />
      </div>
      <div className={classes.container_text}>
         <h2 className={classes.h2}>Обмазувальна Гідроізоляція</h2>
         <p className={classes.p1}>Обмазувальна гідроізоляція — метод, при якому спеціальні композиції наносяться на поверхню у вигляді плівки. Цей спосіб ефективний для покрівель, басейнів та терас. Мазкова гідроізоляція створює надійний захисний шар, який запобігає вологопроникності та гарантує довговічність поверхні.
         </p>
      </div>
    </div>

    <div className={classes.container_btn}>
        <div className={classes.button_container}>
             <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
               {details ? "Закрити Опис" : "Детальніший Опис"}
             </button>
        </div>
        <div className={classes.button_container}>
              <button className={classes.button} >Заказати Послугу</button>
        </div>
     </div>


    <div>
     {details &&<div className={classes.container_info_text}>
      <nav className={classes.nav}>
        <p> У сучасному будівництві захист будівельних конструкцій від впливу вологості має вирішальне значення. Нанесена рідина гідроізоляція є одним із ефективних методів, що забезпечує довговічність та надійність споруд шляхом створення непроникного бар’єру для води.
        </p>
        <h4>Застосування нанесеної рідкої гідроізоляції:</h4>

            <li>Нанесена рідка гідроізоляція є важливим методом для надання захисту різноманітним будівельним поверхням від впливу вологості. Її універсальне застосування охоплює різні варіанти будівництва, починаючи від фундаментів та закінчуючи дахами. Цей метод ефективно використовується для запобігання протіканню, появі плісняви та руйнуванню, пов’язаному з вологостю.</li>

            <li>На фундаментах і підвалах нанесена рідка гідроізоляція відіграє вирішальну роль у запобіганні проникненню грунтових вод та вологості в матеріали. Це особливо важливо в умовах підвищеної вологості або високого рівня грунтових вод, де відсутність надійного захисту може призвести до погіршення якості матеріалів та пошкодження конструкцій.</li>

            <li>Нанесена рідка гідроізоляція також застосовується на стінах будівель. Вона створює бар’єр, який ефективно запобігає проникненню вологості через тріщини, з’єднання та інші вразливі місця. Такий підхід забезпечує довговічність стін та зберігає їхній естетичний вигляд.</li>

            <li>На дахах нанесена рідка гідроізоляція відіграє вирішальну роль у запобіганні протіканню вологості, особливо в умовах дощів та снігопадів. Вона створює захисний шар, який не допускає воді проникнути через покрівлю та пошкодити внутрішні конструкції будівлі.</li>

            <li>Отже, нанесена рідка гідроізоляція виступає як важливий засіб забезпечення надійного захисту будівельних поверхонь від вологості. Її успішне використання сприяє подовженню терміну служби споруд та мінімізації ризиків, пов’язаних з впливом вологості на їхню конструкцію та естетику.</li>

<h4>Процес обмазкової гідроізоляції:</h4>

              <li>Процес обмазкової гідроізоляції є ефективним методом створення вологонепроникної захисту для різних поверхонь. Цей процес включає кілька ключових етапів, які забезпечують надійне гідроізоляційне покриття.</li>

<h4>Підготовка поверхні:</h4>

                <li>Початковий етап включає ретельну підготовку поверхні, яка буде піддаватися обмазковій гідроізоляції. Поверхня повинна бути чистою, вільною від бруду, пилу, масел та інших забруднень. Також важливо, щоб поверхня була сухою, оскільки наявність вологості може негативно вплинути на адгезію гідроізоляційних матеріалів.</li>

<h4>Нанесення гідроізоляційного покриття:</h4>

                 <li>На підготовлену поверхню наноситься гідроізоляційне покриття. Це покриття може бути представлене різними матеріалами: рідкими, пастоподібними або плівковими. Головна мета – створити непроникну мембрану, яка буде запобігати проникненню вологості.</li>

<h4>Рівномірне розподілення матеріалу:</h4>


             <li>Важливо забезпечити рівномірне розподілення гідроізоляційного матеріалу на поверхні. Це дозволяє створити неперервне та герметичне покриття, здатне ефективно відбивати вологу.</li>

<h4>Створення шару гідроізоляції:</h4>

            <li>В результаті нанесення гідроізоляційного матеріалу на поверхню утворюється захисний шар, який не пропускає вологу. Цей шар додатково зміцнюється під час висихання або затвердіння, залежно від типу матеріалу.</li>

<h4>Багаторазове нанесення (за необхідності):</h4>

              <li>У деяких випадках може знадобитися нанесення кількох шарів гідроізоляційного матеріалу для забезпечення додаткової надійності та товщини покриття. Це особливо актуально при роботі з менш щільними та менш міцними поверхнями.</li>

<h4>Висихання та зміцнення:</h4>

            <li>Після нанесення та формування гідроізоляційного шару потрібен час для висихання та зміцнення матеріалу. Час висихання залежить від типу та характеристик використаного гідроізоляційного матеріалу.</li>
            <li>Процес обмазкової гідроізоляції забезпечує надійний бар’єр від проникнення вологості та вологості. Він дозволяє збільшити термін служби конструкцій та підтримувати їхню цілісність та функціональність в умовах вологої середовища.</li>

<h4>Матеріали та технології, що використовуються:</h4>

            <li>Для нанесення гідроізоляції кісткового типу використовуються різноманітні матеріали та технології, спрямовані на створення непроникної бар’єрної плівки проти вологи.</li>
<h4>Ось деякі з них:</h4>

<h4>Бітумні сполуки:</h4>

            <li>Бітумні матеріали є класичними та широко використовуються для гідроізоляції кісткового типу. Вони охоплюють різні типи бітуму, такі як гарячий бітум, холодний бітум, матеріали на основі рулонних покриттів та бітумні емульсії. Бітумні сполуки відрізняються хорошою адгезією до різних поверхонь та гарантують надійну водонепроникність.</li>

<h4>Полімерні сполуки:</h4>

            <li>Полімери використовуються для покращення властивостей гідроізоляційних матеріалів. Полімерні сполуки для нанесення кісткового шару мають гнучкість, адгезію та стійкість до ультрафіолетового випромінювання, що дозволяє їм зберігати свої властивості протягом тривалого періоду.</li>

<h4>Резинові сполуки:</h4>

             <li>Резинові матеріали мають високу стійкість до впливу вологи та хімічних речовин. Вони застосовуються для гідроізоляції різних поверхонь, таких як дахи, фундаменти та стіни.</li>

<h4>Поліуретанові сполуки:</h4>

             <li>Поліуретани мають високу адгезію та гнучкість. Вони можуть бути застосовані як матеріали для нанесення кісткового шару, створюючи непроникний бар’єр для вологи.</li>

<h4>Комбіновані сполуки:</h4>

             <li>Деякі гідроізоляційні матеріали поєднують в собі кілька компонентів, наприклад, бітум із полімерами чи іншими добавками. Це дозволяє об’єднати переваги різних матеріалів для досягнення кращих результатів.</li>

<h4>Рідка мембрана:</h4>

              <li>Це спеціальні полімерні покриття, які наносяться у вигляді рідини. Після висихання вони утворюють міцний, гнучкий та непроникний шар.</li>

<h4>Технології нанесення:</h4>

               <li>Технології нанесення включають використання пензлів, валиків, аерозолів, а також спеціалізованого обладнання, наприклад, аплікаторів для нанесення рідких мембран.</li>

<h4>Термоізоляційні сполуки:</h4>

                <li>Термоізоляційні матеріали також можуть мати гідроізоляційні властивості і використовуватися для захисту від вологи та вологості.</li>
                <li>Використання різноманітних матеріалів та сучасних технологій надає можливість створювати надійні гідроізоляційні покриття, здатні ефективно захищати поверхні від вологи та вологості на протязі тривалого часу.</li>

<h4>Переваги та обмеження:</h4>

<h4>Преимущества обмазкової гідроізоляції:</h4>

<h4>Обробка складних поверхонь:</h4>

               <li>Обмазкова гідроізоляція дозволяє рівномірно нанести захисне покриття на різноманітні поверхні, включаючи навіть складні геометричні форми.</li>

<h4>Стійкість до ультрафіолетового випромінювання:</h4>

               <li>Деякі обмазкові матеріали можуть бути стійкими до впливу ультрафіолетового випромінювання, що дозволяє їм зберігати свої захисні властивості під впливом сонячних променів.</li>

<h4>Міцність та довговічність:</h4>

                <li>Вірно підібрані та нанесені обмазкові матеріали мають високу міцність та довговічність, що сприяє тривалому захисту поверхні від вологи.</li>

<h4>Запобігання корозії:</h4>

                <li>Обмазкова гідроізоляція може допомогти запобігти корозії металевих поверхонь, оскільки створює бар’єр між металом та вологою.</li>

<h4>Обмеження обмазкової гідроізоляції:</h4>

<h4>Якість нанесення:</h4>

               <li>Ефективність обмазкової гідроізоляції залежить від вірної підготовки поверхні та якісного нанесення матеріалів. Недотримання етапів нанесення може призвести до неповної або нерівномірної захисту.</li>

<h4>Вибір матеріалів:</h4>

               <li>Підбір відповідних обмазкових матеріалів грає важливу роль. Невірний вибір може призвести до недостатньої адгезії до поверхні або недовговічності захисного покриття.</li>

<h4>Товщина покриття:</h4>

                <li>Оптимальна товщина обмазкового покриття важлива для забезпечення надійної гідроізоляції. Занадто тонке покриття може бути недостатньо ефективним.</li>

<h4>Важкодоступні місця:</h4>

               <li>У деяких випадках, особливо на складних або важкодоступних поверхнях, може бути складно забезпечити рівномірне і повне нанесення покриття.</li>

<h4>Залежність від якості матеріалів:</h4>

              <li>Якість обмазкових матеріалів та їх виробників може суттєво впливати на ефективність захисту.</li>
            <li>Вірний вибір матеріалів, тщательна підготовка поверхні та якісне нанесення обмазкових матеріалів дотримання строків, специфікацій та рекомендацій виробника — це ключові аспекти для досягнення ефективної обмазкової гідроізоляції.</li>

<h4>Порівняння з іншими методами:</h4>

            <li>Мазкова гідроізоляція може бути особливо ефективною для горизонтальних поверхонь, покрівель та інших областей, де необхідне неперервне і щільне покриття. Однак вибір методу гідроізоляції слід здійснювати, враховуючи характеристики поверхні, конкретні вимоги до захисту та доступність методів в рамках проекту.</li>

<h4>Приклади успішних застосувань:</h4>

            <li>Існує безліч успішних прикладів, що демонструють ефективність мазкової гідроізоляції. Вона успішно використовується при будівництві підземних споруд, зокрема підземних паркінгів та тунелів.</li>

<h4>Поради щодо вибору та застосування:</h4>

            <li>При виборі та нанесенні мазкової гідроізоляції рекомендується звернутися до досвідчених фахівців, які допоможуть визначити найбільш підходящий матеріал та забезпечити якісне нанесення.</li>

<h4>Висновок:</h4>

            <li>Мазкова гідроізоляція відіграє важливу роль у забезпеченні довговічності та цілісності будівельних проектів. Її переваги, зокрема надійність, універсальність та здатність обробляти складні поверхні, роблять цей метод невід’ємною частиною сучасного будівництва. Різноманітність матеріалів для мазкової гідроізоляції дозволяє ефективно створювати водонепроникні бар’єри на різних поверхнях.</li>

            <li>Однак успішне застосування мазкової гідроізоляції вимагає не лише правильного вибору матеріалів, але й тщательної підготовки поверхні та якісного нанесення покриття. Експерти та підрядники з досвідом у цій галузі відіграють ключову роль у забезпеченні ефективності цього методу. Мазкова гідроізоляція і надалі залишається важливим елементом, забезпечуючи довговічність та надійність будівельних конструкцій від впливу вологи та води.</li>









      </nav>

      <div className={classes.container_btn}>
       <div className={classes.button_container}>
           <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
           Закрити Опис
           </button>
       </div>
       <div className={classes.button_container}>
           <button className={classes.button} >Заказати Послугу</button>
       </div>
      </div>


    </div>}


  </div>
  <div className={classes.button_top}>
  <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
  </div>

    {/* <button className={classes.button_wrapp} onClick={() => Router.push(`/`)}>Вернутись назад</button> */}
    </div>

   </div>


   </Layout>
   </>
   )
}