import React, { useState } from "react";
import classes from "../styles/rezka.module.css"
import Router from "next/router";
import {Layout} from "/components/Layout/Layout.jsx"
import Image from "next/image";

export default function Shtukatur() {
  const [details, setDetails] = useState(false);
  const btnClassName = details ? classes.button_b : classes.button;
   return (
   <>
   <Layout title={`Штукатурна Гідроізоляція`}>
   <div className={classes.wrapper}>
    <div className={classes.container_wrapp}>


     <div className={classes.container_info}>
       <div className={classes.container_image}>
        <Image
        className={classes.image}
         src="/images/image_slaider/shtukatur_gidro.png"
         width={500}
         height={350}
         alt="shtukatur"
         priority
         />
      </div>
      <div className={classes.container_text}>
         <h2 className={classes.h2}>Штукатурна Гідроізоляція</h2>
         <p className={classes.p1}>Штукатурна гідроізоляція — це універсальне рішення для захисту поверхонь від вологи. Спеціальні композиції наносяться на поверхню у вигляді штукатурки, створюючи надійний бар'єр. Цей метод підходить для фасадів, стін та інших вертикальних поверхонь. Ми гарантуємо якісну штукатурну гідроізоляцію, яка забезпечить довговічність вашої будівлі.
         </p>
      </div>
    </div>

    <div className={classes.container_btn}>
        <div className={classes.button_container}>
             <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
               {details ? "Закрити Опис" : "Детальніший Опис"}
             </button>
        </div>
        <div className={classes.button_container}>
              <button className={classes.button} >Заказати Послугу</button>
        </div>
     </div>


    <div>
     {details &&<div className={classes.container_info_text}>
      <nav className={classes.nav}>
        <p> У сучасному будівництві захист будівельних конструкцій від впливу вологості має вирішальне значення. Нанесена рідина гідроізоляція є одним із ефективних методів, що забезпечує довговічність та надійність споруд шляхом створення непроникного бар’єру для води.
        </p>
        <h4>Застосування штукатурної гідроізоляції:</h4>

<li>Штукатурна гідроізоляція є незамінним інструментом для забезпечення надійного захисту різних будівельних поверхонь від впливу вологості. Її застосування охоплює широкий спектр областей, починаючи з зовнішніх фасадів будівель і закінчуючи внутрішніми приміщеннями, включаючи ванні та кухонні зони. Цей метод успішно справляється з низкою проблем, пов’язаних з вологості, які можуть серйозно негативно вплинути на якість та тривалість будівельних конструкцій.</li>

<li>На фасадах будівель штукатурна гідроізоляція відіграє важливу роль у запобіганні проникнення вологи в матеріали стін. Це особливо актуально в умовах змінної погоди, коли дощ та вологість можуть викликати пошкодження та руйнування будівельних матеріалів. Штукатурна гідроізоляція створює бар’єр, який ефективно запобігає потраплянню води в структуру будівлі.</li>

<li>Всередині будівель цей метод також має широке застосування. В ванних і кухонних зонах, де вологість часто підвищена, штукатурна гідроізоляція допомагає запобігти появі плісняви і грибків, які не лише псують зовнішній вигляд, але і можуть викликати проблеми зі здоров’ям. Також вона може запобігти замерзанню стін і пошкодженню від вологи всередині приміщень.</li>

<li>Штукатурна гідроізоляція – це надійний спосіб забезпечити захист будівельних поверхонь від вологості та всіх негативних наслідків, пов’язаних з її впливом. Її застосування сприяє збільшенню терміну служби будівель і приміщень, а також підтримує їхній естетичний і функціональний стан протягом тривалого часу.</li>

<h4>Процес гідроізоляції штукатуркою:</h4>

<li>Процес гідроізоляції штукатуркою є важливим етапом забезпечення захисту поверхонь від впливу вологості. Цей процес включає кілька етапів, кожен з яких відіграє вирішальну роль у створенні ефективної водонепроникної бар’єрної системи.</li>

<h4>Підготовка поверхні:</h4>

<li>Початковим етапом є ретельна підготовка поверхні, яка буде оброблятися. Це включає в себе видалення старого штукатурки, мазків та інших покриттів. Також проводиться огляд поверхні на наявність тріщин, дефектів та інших проблем, які можуть становити ризик проникнення вологи.</li>

<h4>Вибір гідроізоляційної штукатурки:</h4>

<li>Для створення водовідштовхувального шару використовується спеціальна гідроізоляційна штукатурка. Цей матеріал має особливі хімічні властивості, які запобігають проникненню вологи. При виборі штукатурки враховуються характеристики поверхні та умови експлуатації.</li>

<h4>Нанесення гідроізоляційної штукатурки:</h4>

<li>Після підготовки поверхні починається нанесення гідроізоляційної штукатурки. Це може бути зроблено вручну або за допомогою спеціального обладнання. Штукатурка наноситься в одному або кількох шарах в залежності від потрібної товщини та надійності гідроізоляції.</li>

<h4>Формування шару гідроізоляції:</h4>

<li>Нанесення гідроізоляційної штукатурки створює на поверхні захисний шар, який заважає проникненню вологи. Цей шар має водовідштовхувальні властивості та здатний утримувати вологу на поверхні, не допускаючи її проникнення в матеріали.</li>

<h4>Висихання та затвердіння:</h4>

<li>Після нанесення гідроізоляційної штукатурки вона потребує часу для висихання та затвердіння. Час висихання залежить від типу штукатурки та умов навколишнього середовища.</li>

<h4>Перевірка та тестування:</h4>

<li>Після висихання проводиться перевірка якості нанесення гідроізоляційної штукатурки. Може бути проведене тестування водонепроникності, щоб упевнитись у ефективності створеного бар’єру.</li>
<li>Процес штукатурної гідроізоляції забезпечує надійний захисний шар, здатний запобігти проникненню вологи в матеріали. Метод забезпечує довгостроковий захист та підвищує довговічність споруд, мінімізуючи негативний вплив вологи на їхню структуру та функціональність.</li>

<h4>Використані матеріали та технології:</h4>

<li>Для штукатурної гідроізоляції використовуються спеціальні гідроізоляційні матеріали та технології, які забезпечують створення надійної відштовхувальної поверхні та запобігають проникненню вологи.</li>

<h4>Ось деякі з них:</h4>

<h4>Гідроізоляційні штукатурки:</h4>

 <li>Це спеціалізовані суміші, які збагачені добавками, що покращують їх гідроізоляційні властивості. Гідроізоляційні штукатурки наносяться на поверхню стіни або іншої конструкції, створюючи захисний бар’єр від води.</li>

<h4>Полімермодифіковані штукатурки:</h4>

 <li>Ці штукатурки містять полімерні добавки, які надають їм додаткову гнучкість та адгезію. Це особливо корисно у ситуаціях, де поверхня може піддаватися механічним напруженням.</li>

<h4>Кристалізуючі гідроізоляційні матеріали:</h4>

 <li>Ці матеріали містять спеціальні кристали, які при взаємодії з вологою утворюють кристалічну структуру, що заповнює пори та тріщини. Це створює непроникний бар’єр для води.</li>

<h4>Еластомерні покриття:</h4>

 <li>Еластомери утворюють еластичний шар на поверхні, який має високу стійкість до деформацій та може протистояти рухам конструкції. Вони широко використовуються для гідроізоляції підвалів та фундаментів.</li>

<h4>Нанотехнології:</h4>

 <li>Нові технології включають використання наночастинок, які покращують адгезію та гідроізоляційні властивості матеріалів. Наночастинки можуть допомагати заповнювати найдрібніші пори та тріщини, створюючи більш надійний бар’єр.</li>

<h4>Покращені адгезиви:</h4>

 <li>Розробка нових адгезивів та клейових складів сприяє більш надійній фіксації гідроізоляційних матеріалів на поверхні, забезпечуючи довговічність захисного шару.</li>

<h4>Спеціальні грунтівки:</h4>

<li>Грунтівки з гідроізоляційними добавками використовуються для підготовки поверхні перед нанесенням гідроізоляційних матеріалів. Вони забезпечують кращу адгезію та підвищують ефективність гідроізоляції.</li>
<li>Використання спеціалізованих гідроізоляційних матеріалів та нових технологій дозволяє створювати надійні гідроізоляційні шари, які ефективно захищають поверхні від вологи та вологості.</li>

<h4>Переваги та обмеження:</h4>

<h4>Переваги штукатурної гідроізоляції:</h4>

<h4>Універсальність застосування:</h4>

 <li>Штукатурна гідроізоляція може бути успішно використана на різних поверхнях, включаючи фасади будівель, внутрішні приміщення, а також ванні та кухонні зони.</li>

<h4>Надійність:</h4>

 <li>Правильно виконана штукатурна гідроізоляція створює непроникний бар’єр, який запобігає проникненню вологи та водних розчинів у матеріали.</li>

<h4>Естетичність:</h4>

 <li>Штукатурка може мати різноманітні декоративні текстури та кольори, що дозволяє зберегти естетичний вигляд поверхні при одночасній гідроізоляції.</li>

<h4>Попередження утворення плісняви:</h4>

 <li>Штукатурка, яка володіє гідроізоляційними властивостями, запобігає накопиченню вологи, зменшуючи ймовірність утворення плісняви та грибка.</li>

<h4>Обмеження штукатурної гідроізоляції:</h4>

<h4>Складні форми поверхонь:</h4>

 <li>Штукатурна гідроізоляція може бути ускладненою для обробки поверхонь із заплутаними геометричними формами, оскільки може знадобитися більше часу та зусиль для рівномірного нанесення.</li>

<h4>Рухи в конструкції:</h4>

<li>Якщо в конструкції є значні деформації або рухи (наприклад, пов’язані з температурними змінами або осіданням грунту), штукатурка може тріснути або відокремитися.</li>

<h4>Не завжди вирішує кореневу причину:</h4>

 <li>Штукатурна гідроізоляція запобігає вологопроникненню, але вона може не вирішити проблему, якщо причина вологості пов’язана з іншими факторами, наприклад, неправильною системою дренажу.</li>

<h4>Підготовка поверхні:</h4>

 <li>Для досягнення хороших результатів необхідна ретельна підготовка поверхні, включаючи видалення старих матеріалів та виправлення дефектів. Неправильна підготовка може знизити ефективність гідроізоляції.</li>
 <li>При виборі методу гідроізоляції важливо враховувати конкретні умови об’єкта, його характеристики та особливості, щоб отримати кращий результат і мінімізувати можливі обмеження.</li>

<h4>Порівняння з іншими методами:</h4>

<li>Штукатурна гідроізоляція надає більш єдність захист і може поліпшити вигляд споруд, що робить її привабливим варіантом для тих, хто шукає надійне і естетично задовільне рішення. Проте, при виборі методу гідроізоляції, слід враховувати особливості поверхні, матеріалу, вимог до захисту та доступність методів у межах проекту.</li>

<h4>Приклади успішних застосувань:</h4>

<li>Застосування штукатурної гідроізоляції успішно використовується при реабілітації старих будівель, а також при будівництві нових об’єктів, які потребують надійного захисту від вологості.</li>

<h4>Поради щодо вибору та впровадження:</h4>

<li>Для успішної штукатурної гідроізоляції важливо правильно вибрати гідроізоляційні матеріали, а також забезпечити якісне нанесення шарів штукатурки. Рекомендується проконсультуватися з досвідченими спеціалістами.</li>

<h4>Висновок:</h4>

<li>Штукатурна гідроізоляція – це важливий метод забезпечення захисту будівельних поверхонь від впливу вологості, який забезпечує довговічність і збереження споруд. Цей метод поєднує в собі передові технології та інженерну експертизу для створення надійних бар’єрів, здатних ефективно впоратися з викликами вологої середовища.</li>

<li>Вибором правильних гідроізоляційних матеріалів та ретельним нанесенням шарів штукатурки можна створити надійний захист, забезпечивши довгий термін служби конструкцій. Штукатурна гідроізоляція має значуще значення не лише для збереження будівель, але й для покращення їхнього вигляду та естетичної привабливості.</li>

<li>Цей метод демонструє свою ефективність у вирішенні проблем вологості, що робить його невід’ємною складовою сучасних будівельних практик. Правильне застосування штукатурної гідроізоляції передбачає врахування особливостей кожного проекту, а також використання якісних матеріалів та професійної експертизи.</li>




      </nav>

      <div className={classes.container_btn}>
       <div className={classes.button_container}>
           <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
           Закрити Опис
           </button>
       </div>
       <div className={classes.button_container}>
           <button className={classes.button} >Заказати Послугу</button>
       </div>
      </div>


    </div>}


  </div>
  <div className={classes.button_top}>
  <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
  </div>

    </div>

   </div>


   </Layout>
   </>
   )
}