import React, { useState } from "react";
import classes from "../styles/rezka.module.css"
import Router from "next/router";
import {Layout} from "/components/Layout/Layout.jsx";

import Image from "next/image";

export default function Rezka() {
  const [details, setDetails] = useState(false);
  const btnClassName = details ? classes.button_b : classes.button;
   return (
   <>
   <Layout title={`Алмазна Різка`}>
   <div className={classes.wrapper}>
    <div className={classes.container_wrapp}>


     <div className={classes.container_info}>
       <div className={classes.container_image}>
        {/* <img className={classes.image}></img> */}
        <Image
        className={classes.image}
         src="/images/image_slaider/almaz_rezka.png"
         width={500}
         height={350}
         alt="rezka"
         priority
         />
      </div>
      <div className={classes.container_text}>
         <h2 className={classes.h2}>Алмазне Різання</h2>
         <p className={classes.p1}>Алмазна різка — технологія, що дозволяє створювати чіткі та точні розрізи в
          різних матеріалах. Цей метод використовується для створення отворів, проемів та для демонтажу частин
          конструкцій. Наша компанія забезпечує високоточну алмазну різку, яка допоможе вам реалізувати
          складні проекти з гідроізоляції.
          </p>
      </div>
    </div>



    <div className={classes.container_btn}>
        <div className={classes.button_container}>
             <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
               {details ? "Закрити Опис" : "Детальніший Опис"}
             </button>
        </div>
        <div className={classes.button_container}>
              <button className={classes.button} >Заказати Послугу</button>
        </div>
     </div>




  <div>
     {details &&<div className={classes.container_info_text}>
      <nav className={classes.nav}>
        <p> У сфері будівництва та ремонту точність та ефективність є ключовими факторами. Алмазна різка – це сучасний метод, що дозволяє виконувати аккуратні та точні різи у різних будівельних матеріалах. Він знайшов широке застосування в різних галузях, від будівництва до демонтажу.</p>

         <h4>Застосування алмазної різки:</h4>
          <li>Алмазна різка – це універсальний та високотехнологічний метод, який знаходить широке застосування в різних галузях будівництва та ремонту. Її точність та здатність обробляти найтвердіші матеріали роблять цей метод незамінним інструментом для створення прорізів, різання, демонтажу та інших завдань.</li>
          <li>У галузі будівництва алмазна різка використовується для створення прорізів у стінах та перекриттях. Це може бути необхідним при установці дверей, вікон, вентиляційних отворів та інших комунікацій. Точні різи, які можна отримати за допомогою алмазної різки, дозволяють мінімізувати пошкодження навколишніх конструкцій.</li>
          <li>Різка плиток, бетонних та залізобетонних конструкцій – це ще одна важлива галузь застосування алмазної різки. Метод дозволяє виконувати точні та чисті різи навіть у найщільніших матеріалах, таких як бетон, залізобетон та камінь. Це особливо актуально при ремонті та реконструкції, коли потрібно зробити точні та якісні зміни в існуючих конструкціях.</li>
          <li>Алмазна різка також знаходить своє застосування в демонтажі та видаленні надлишкових елементів. Вона дозволяє виконувати точні та контрольовані різи, що особливо важливо при роботі в обмежених чи чутливих умовах.</li>
          <li>Спільним для всіх цих завдань є висока точність та якість, які досягаються завдяки алмазній різці. Цей метод є сучасним рішенням для складних будівельних та ремонтних завдань, забезпечуючи мінімальні пошкодження та максимальну ефективність робіт.</li>

          <h4>Процес алмазної різки:</h4>
          <li>Процес алмазної різки є ефективним методом для створення точних та чистих розтинів у різних матеріалах. Цей процес використовує спеціалізовані інструменти з алмазними сегментами для подолання матеріалів з високою міцністю та твердістю.</li>

          <h4>Вибір відповідного інструменту:</h4>
          <li>Залежно від типу матеріалу та вимог до розтину, вибирається відповідний інструмент для алмазної різки. Це може бути дискова пила, ручний різак, алмазна ланцюгова пила та інші спеціалізовані інструменти.</li>

          <h4>Підготовка поверхні:</h4>
          <li>Поверхня, яку планується різати, повинна бути чистою та готовою до роботи.</li>
          <li>При необхідності поверхню може бути попередньо оброблено або закріплено для забезпечення безпеки та точності процесу.</li>

          <h4>Робота з інструментом:</h4>
          <li>Інструмент з алмазними сегментами встановлюється та готується до роботи. Потім інструмент починає обертатися або рухатися вздовж лінії розтину. Алмази, що знаходяться на сегментах, створюють мікророзриви в матеріалі, подолавши його твердість.</li>

          <h4>Охолодження та видалення матеріалу:</h4>
          <li> Важливо забезпечити охолодження інструменту та місця розтину, щоб запобігти перегріву та пошкодженню алмазів. Одночасно відбувається видалення утвореної стружки та пилу.</li>

          <h4>Точність та контроль:</h4>
          <li> Процес алмазної різки контролюється з високою точністю. Це дозволяє створювати точні, рівні та чисті розтини, мінімізуючи пошкодження навколишньої конструкції.</li>

          <h4>Завершення та обробка розтину:</h4>
          <li> Після завершення різки може бути необхідна обробка розтину для видалення залишкової стружки та отримання гладкої поверхні.Процес алмазної різки відрізняється високою точністю, міцністю та здатністю подолати навіть найтвердіші матеріали. Він знаходить широке застосування в будівництві, ремонті, демонтажі та інших галузях, де потрібно точне та якісне створення розтинів з мінімальними пошкодженнями навколишньої конструкції.</li>

          <h4>Використовувані матеріали та технології:</h4>
          <li>Алмазна різка ґрунтується на спеціалізованому обладнанні та сучасних технологіях для забезпечення високої точності та ефективності процесу. Ось деякі з них:</li>

          <h4>Алмазні диски та леза:</h4>
          <li>Алмазні диски та леза – це інструменти з алмазними кристалами, які використовуються для різання різних матеріалів. Вони мають різні розміри, форми та характеристики алмазних сегментів в залежності від типу матеріалу.</li>

          <h4>Алмазні ланцюги:</h4>
          <li> В алмазній різці використовують алмазні зуби, які можуть бути використані для різання більш товстих матеріалів, таких як бетон або камінь, що робить їх підходящими для робіт із великим навантаженням.</li>

          <h4>Різноманітність алмазних сегментів:</h4>
          <li> Сегменти на алмазних дисках та лезах можуть мати різні форми, типи та розміри залежно від завдання. Наприклад, сегменти для різання бетону будуть відрізнятися від сегментів для різання кераміки.</li>

          <h4>Системи охолодження:</h4>
          <li> Алмазна різка може призводити до високих температур і зносу інструменту. Тому застосовуються системи охолодження, які допомагають запобігти перегріву алмазних сегментів та збільшують їх термін служби.</li>

          <h4>Регульована глибина різання:</h4>
          <li>Сучасні алмазні інструменти та обладнання дозволяють регулювати глибину різання, що дозволяє точніше виконувати різноманітні завдання.</li>

          <h4>Багатогвинтові диски:</h4>
          <li>Для деяких завдань, таких як різання жорсткої армованої бетонної конструкції, використовують багатогвинтові алмазні диски, які забезпечують більш ефективне різання та справляються з великим навантаженням.</li>

          <h4>Технології виготовлення алмазів:</h4>
          <li> Алмази, які використовуються для створення алмазних сегментів, виробляються за допомогою сучасних технологій, що дозволяють отримувати кристали з певними характеристиками.</li>

          <h4>Електричні та гідравлічні системи:</h4>
          <li>Обладнання для алмазної різки може бути електричним або гідравліччним, в залежності від місця та умов роботи.
            Використання спеціалізованих алмазних інструментів та сучасних технологій дозволяє досягати високої точності, продуктивності та якості при здійсненні алмазної різки різних матеріалів, таких як бетон, камінь, метал та інші.</li>

          <h4>Переваги та обмеження.</h4>


          <h4>Висока точність: </h4>
          <li>Алмазна різка забезпечує високу точність при створенні розрізів та отворів, що особливо важливо при роботі з матеріалами, які вимагають точних розмірів.</li>

          <h4>Мінімальні вібрації:</h4>
          <li>Вібрації при алмазній різці набагато менше, ніж при використанні інших методів різки, що сприяє збереженню цілісності навколишніх конструкцій.</li>

          <h4>Відсутність пилу:</h4>
          <li>Алмазна різка практично не створює пилу, що знижує ризик забруднення робочої області та негативного впливу на здоров’я.</li>

          <h4>Мінімальний вплив на навколишні конструкції:</h4>
          <li>Завдяки високій точності та контролю при алмазній різці, ризик пошкодження сусідніх конструкцій мінімальний.</li>

          <h4>Вибір підходящого інструменту:</h4>
          <li> Для різних матеріалів та завдань потрібні різні типи алмазних дисків або полотен. Неправильний вибір інструменту може призвести до неефективної різки.</li>

          <h4>Обережність та досвід:</h4>
          <li>Важливо мати досвід та знання для правильної оцінки параметрів різки, а також для забезпечення безпеки робочого процесу.</li>

          <h4>Важкодоступні місця:</h4>
          <li>В деяких випадках, особливо при різці вузьких або незручних місцях, може бути важко забезпечити достатній простір для роботи інструментів.</li>

          <h4>Швидкість роботи:</h4>
          <li>Порівняно з деякими іншими методами різки, алмазна різка може бути повільнішою, особливо при роботі з товстими та жорсткими матеріалами.</li>

          <h4>Залежність від матеріалу: </h4>
          <li>Алмазна різка найбільш ефективна при роботі з жорсткими матеріалами, тоді як для більш м’яких матеріалів вона може бути зайвою.Важливо враховувати переваги та обмеження алмазної різки при виборі методу обробки матеріалів та правильно підбирати інструменти та технології для конкретної задачі.</li>

          <h4>Порівняння з іншими методами:</h4>
          <li>Алмазний різ – це надзвичайно ефективний метод для завдань, де потрібна висока точність, мінімальні вібрації та менше впливу на оточуючі матеріали. Важливо вибирати відповідне обладнання для конкретного завдання та виконувати роботу обережно, дотримуючись стандартів безпеки.</li>

          <h4>Приклади успішних застосувань:</h4>
          <li>Алмазний різ успішно застосовується при створенні отворів для вікон та дверей у стінах, різанні бетонних плит, демонтажі старих конструкцій та ремонті будівель.</li>

          <h4>Поради щодо вибору та застосування:</h4>
          <li>Для успішного алмазного різання важливо вибрати відповідний інструмент, врахувати властивості матеріалу та звернутися до досвідчених фахівців.</li>

          <h4>Висновок:</h4>
          <li>Алмазний різ – це передовий метод у будівництві, який забезпечує високоточне та мінімально втручаюче виконання різання в різних матеріалах. Застосування цього методу значно сприяє покращенню продуктивності та якості в будівельних проектах.</li>
          <li>Переваги алмазного різання, такі як висока точність, мінімальні вібрації, відсутність пилу та низька ймовірність пошкодження сусідніх конструкцій, роблять його незамінним інструментом на будівельних майданчиках. Проте успішне алмазне різання передбачає правильний вибір інструментів та обладнання, а також створення безпечних і технічно обґрунтованих умов роботи. Алмазне різання і надалі залишається ключовою складовою сучасних будівельних технологій, що покращує ефективність та якість будівельних проектів.</li>
      </nav>

      <div className={classes.container_btn}>
       <div className={classes.button_container}>
           <button className={btnClassName} onClick={() => (setDetails (prev => !prev))}>
           Закрити Опис
           </button>
       </div>
       <div className={classes.button_container}>
           <button className={classes.button} >Заказати Послугу</button>
       </div>
      </div>



    </div>}


  </div>
     <div className={classes.button_top}>
      <button className={classes.button} onClick={() => Router.push(`/`)}>Вернутись назад</button>
      </div>

    {/* <button className={classes.button_wrapp} onClick={() => Router.push(`/`)}>Вернутись назад</button> */}
    </div>

   </div>



   </Layout>
   </>
   )
}